Revit 2027 API
FamilyType.AsString Method
Provides access to the string contents of the given family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsString(
	FamilyParameter familyParameter
)
Public Function AsString (
	familyParameter As FamilyParameter
) As String
public:
String^ AsString(
	FamilyParameter^ familyParameter
)
member AsString :
        familyParameter : FamilyParameter -> string
Parameters
familyParameter FamilyParameter
Return Value
String
The string contained in the parameter. Returns null if the storage type of the input argument is not string type or this parameter has no value.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid,
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace